In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("number-of-jobs-by-comany-in-ME-0223.csv")
df.head()

         CompanyName  JobsInTotal         City State
0  Zynex Medical Inc            1       Albany    ME
1      Zynex Medical            2     Portland    ME
2      Zynex Medical            1      Augusta    ME
3          Zurich NA           24      Augusta    ME
4          Zurich NA            1  Augusta, ME    ME

In [8]:
df.info()
df.describe(include='all')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 41785 entries, 0 to 41784
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CompanyName  41784 non-null  object
 1   JobsInTotal  41785 non-null  int64
 2   City         41104 non-null  object
 3   State        41785 non-null  object
dtypes: int64(1), object(3)
memory usage: 1.3+ MB

                        CompanyName   JobsInTotal      City  State
count                         41784  41785.000000     41104  41785
unique                        12109           NaN      1316      1
top     Consolidated Communications           NaN  Portland     ME
freq                            265           NaN      4029  41785
mean                            NaN      6.130549       NaN    NaN
std                             NaN     23.298222       NaN    NaN
min                             NaN      1.000000       NaN    NaN
25%                             NaN      1.000000       NaN    NaN
50%                             NaN      2.000000       NaN    NaN
75%                             NaN      4.000000       NaN    NaN
max                             NaN   1876.000000       NaN    NaN

In [17]:
df[df.CompanyName.isnull()]
df.loc[df.CompanyName.isnull(), 'CompanyName'] = 'Unknown'
df

,CompanyName,JobsInTotal,City,State
0,Zynex Medical Inc,1,Albany,ME
1,Zynex Medical,2,Portland,ME
2,Zynex Medical,1,Augusta,ME
3,Zurich NA,24,Augusta,ME
4,Zurich NA,1,"Augusta, ME",ME
...,...,...,...,...
41780,0097 Barber Foods LLC,1,Portland,ME
41781,0097 Barber Foods LLC,1,Portland Plant - Portland,ME
41782,"001-Dialysis Clinic, Inc.-Nashville, TN- Corpo...",2,Fairfield,ME
41783,#twiceasnice Recruiting,5,Portland,ME
41784,The University of St. Augustine for Health Sc...,1,NaN,ME